mit41301/dsPIC33AKMC102-AM-Radio/33ak128mc102 018 SinCos.X/clock.c
// Created by MCC
#include <xc.h>

#include "clock.h"


#define PLL1FOUT_SOURCE         0x5U
#define PLL2VCODIV_SOURCE       0x8U 

// Section: Static Variables


void ClkInit(void)
{
    /*  
        System Clock Source                             :  PLL1 VCO Divider output
        System/Generator 1 frequency (Fosc)             :  200 MHz
        
        Clock Generator 2 frequency                     : 8 MHz
        Clock Generator 3 frequency                     : 8 MHz
        Clock Generator 6 frequency                     : 320 MHz
        Clock Generator 7 frequency                     : 400 MHz
        Clock Generator 8 frequency                     : 320 MHz
        Clock Generator 12 frequency                     : 160 MHz
        
        PLL 1 frequency                                 : 320 MHz
        PLL 1 VCO Out frequency                         : 800 MHz

    */
    OSCCFGbits.POSCMD = 0x1U;
    
    OSCCTRLbits.POSCEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR
    while(OSCCTRLbits.POSCRDY == 0U){};
#endif
    
    //If CLK GEN 1 (system clock) is using a PLL, switch to FRC to avoid risk of over-clocking the CPU while changing PLL settings
    if((CLK1CONbits.COSC >= PLL1FOUT_SOURCE) && (CLK1CONbits.COSC <= PLL2VCODIV_SOURCE))
    {
        CLK1CONbits.NOSC = 1U; //FRC as source 
        CLK1CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR
        while(CLK1CONbits.OSWEN == 1U){};
#endif
    }
    
    // NOSC Primary Oscillator; OE enabled; SIDL disabled; ON enabled; BOSC Serial Test Mode clock (PGC); FSCMEN disabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL disabled; EXTCFEN disabled; FOUTSWEN disabled; RIS disabled; PLLSWEN disabled; 
    PLL1CON = 0x9300UL;
    // POSTDIV2 1x divide; POSTDIV1 5x divide; PLLFBDIV 200; PLLPRE 1; 
    PLL1DIV = 0x100C829UL;
    //Enable PLL Input and Feedback Divider update
    PLL1CONbits.PLLSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR
    while (PLL1CONbits.PLLSWEN == 1){};
#endif
    PLL1CONbits.FOUTSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR
    while (PLL1CONbits.FOUTSWEN == 1U){};
#endif
    //enable clock switching
    PLL1CONbits.OSWEN = 1U; 
#ifndef __MPLAB_DEBUGGER_SIMULATOR 
    //wait for switching
    while(PLL1CONbits.OSWEN == 1U){}; 
    //wait for clock to be ready
    while(OSCCTRLbits.PLL1RDY == 0U){};    
#endif
    
    //Configure VCO Divider
    // INTDIV 1; 
    VCO1DIV = 0x10000UL;
    //enable PLL VCO divider
    PLL1CONbits.DIVSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR     
    //wait for setup complete
    while(PLL1CONbits.DIVSWEN == 1U){}; 
#endif
    //Clearing ON shuts down oscillator when no downstream clkgen or peripheral is requesting the clock
    PLL1CONbits.ON = 0U;
    
    // NOSC PLL1 VCO Divider output; OE enabled; SIDL disabled; ON enabled; BOSC Backup FRC Oscillator; FSCMEN enabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL External clock fail detection module #1; EXTCFEN disabled; RIS disabled; 
    CLK1CON = 0x129700UL;
    // FRACDIV 0; INTDIV 2; 
    CLK1DIV = 0x20000UL;
    //enable divide factors
    CLK1CONbits.DIVSWEN = 1U; 
    //wait for divide factors to get updated
#ifndef __MPLAB_DEBUGGER_SIMULATOR 
    while(CLK1CONbits.DIVSWEN == 1U){};
#endif
    //enable clock switching
    CLK1CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR    
    //wait for clock switching complete
    while(CLK1CONbits.OSWEN == 1U){};
#endif
    
    // NOSC FRC Oscillator; OE enabled; SIDL disabled; ON enabled; BOSC Backup FRC Oscillator; FSCMEN disabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL External clock fail detection module #1; EXTCFEN disabled; RIS disabled; 
    CLK2CON = 0x29101UL;
    //enable clock switching
    CLK2CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR    
    //wait for clock switching complete
    while(CLK2CONbits.OSWEN == 1U){};
#endif
    
    // NOSC Backup FRC Oscillator; OE enabled; SIDL disabled; ON enabled; BOSC FRC Oscillator; FSCMEN disabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL External clock fail detection module #1; EXTCFEN disabled; RIS disabled; 
    CLK3CON = 0x19202UL;
    //enable clock switching
    CLK3CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR    
    //wait for clock switching complete
    while(CLK3CONbits.OSWEN == 1U){};
#endif
    
    // NOSC PLL1 Out output; OE enabled; SIDL disabled; ON enabled; BOSC Backup FRC Oscillator; FSCMEN disabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL External clock fail detection module #1; EXTCFEN disabled; RIS disabled; 
    CLK6CON = 0x29500UL;
    // FRACDIV 0x0; INTDIV 0x0; 
    CLK6DIV = 0x0UL;
    //enable clock switching
    CLK6CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR    
    //wait for clock switching complete
    while(CLK6CONbits.OSWEN == 1U){};
#endif
    
    // NOSC PLL1 VCO Divider output; OE enabled; SIDL disabled; ON enabled; BOSC Backup FRC Oscillator; FSCMEN disabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL External clock fail detection module #1; EXTCFEN disabled; RIS disabled; 
    CLK7CON = 0x29700UL;
    // FRACDIV 0; INTDIV 1; 
    CLK7DIV = 0x10000UL;
    //enable divide factors
    CLK7CONbits.DIVSWEN = 1U; 
    //wait for divide factors to get updated
#ifndef __MPLAB_DEBUGGER_SIMULATOR 
    while(CLK7CONbits.DIVSWEN == 1U){};
#endif
    //enable clock switching
    CLK7CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR    
    //wait for clock switching complete
    while(CLK7CONbits.OSWEN == 1U){};
#endif
    
    // NOSC PLL1 Out output; OE enabled; SIDL disabled; ON enabled; BOSC Backup FRC Oscillator; FSCMEN disabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL External clock fail detection module #1; EXTCFEN disabled; RIS disabled; 
    CLK8CON = 0x29500UL;
    // FRACDIV 0x0; INTDIV 0x0; 
    CLK8DIV = 0x0UL;
    //enable clock switching
    CLK8CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR    
    //wait for clock switching complete
    while(CLK8CONbits.OSWEN == 1U){};
#endif
    
    // NOSC PLL1 Out output; OE enabled; SIDL disabled; ON enabled; BOSC Backup FRC Oscillator; FSCMEN disabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL External clock fail detection module #1; EXTCFEN disabled; RIS disabled; 
    CLK12CON = 0x29500UL;
    // FRACDIV 0; INTDIV 1; 
    CLK12DIV = 0x10000UL;
    //enable divide factors
    CLK12CONbits.DIVSWEN = 1U; 
    //wait for divide factors to get updated
#ifndef __MPLAB_DEBUGGER_SIMULATOR 
    while(CLK12CONbits.DIVSWEN == 1U){};
#endif
    //enable clock switching
    CLK12CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR    
    //wait for clock switching complete
    while(CLK12CONbits.OSWEN == 1U){};
#endif
    
    
    
}





